//7. Создайте программу, которая на вход принимает трехзначное число, а на выходе показывает третью цифру этого числа
// Console.WriteLine("Введите трехзначное число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int thirdDigit = 0;
// thirdDigit = number%10;
// Console.WriteLine (thirdDigit);

// Задача 2. Напишите программу, которая на вход принимает 2 числа и выдает, какое больше 
// Console.WriteLine("Введите первое число: ");
// int number1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число: ");
// int number2 = Convert.ToInt32(Console.ReadLine());
// int max = number1;
// if (number2>number1) max = number2;
// Console.WriteLine($"max {max}");


