// Напишите программу, которая на вход принимает число и выдает его квадрат
// Console.Write ("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int square = number*number;
// Console.WriteLine (square);

// Задача 2. Напишите программу, кот на вход принимает 2 числа и проверяет, является ли первое число квадратом второго
Console.WriteLine ("Введите число А: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine ("Введите число B: ");
int b = Convert.ToInt32(Console.ReadLine());
if (a == b*b) Console.WriteLine ($"da");
else Console.WriteLine ($"net");
